<template>
 <div>
  
      <div class="test_rejm"><marquee>{{$t('test')}}</marquee></div>
        <div class="managements port_fo">
          <div class="cards_one_f">
                  <div>
                    <div class="cards_one">
       <Navbar></Navbar>
      <div class="nav_left_container">
        <div class="row">
          <div class="col-xl-6">
            <div class="main_text ">
              Карьера в команде  Dacc
            </div>
          </div>
          </div>
      </div>
    </div>
    <div class="manage_f">
     <section class="nav_left_container struct">
      <div class="career_cards" v-for="item in 4" :key="item">
        <div>
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.0009 30.6669C24.1011 30.6669 30.6677 24.1003 30.6677 16C30.6677 7.89971 24.1011 1.33313 16.0009 1.33313C7.90057 1.33313 1.33398 7.89971 1.33398 16C1.33398 24.1003 7.90057 30.6669 16.0009 30.6669Z" fill="#E6FFED"/>
            <path d="M16 32C7.1775 32 0 24.8225 0 16C0 7.1775 7.1775 0 16 0C24.8225 0 32 7.1775 32 16C32 24.8225 24.8225 32 16 32ZM16 2.66687C8.64812 2.66687 2.66687 8.64812 2.66687 16C2.66687 23.3519 8.64812 29.3331 16 29.3331C23.3519 29.3331 29.3331 23.3519 29.3331 16C29.3331 8.64812 23.3519 2.66687 16 2.66687Z" fill="#5A46D5"/>
            <path d="M14.6664 21.3331C14.4034 21.3334 14.1463 21.2555 13.9277 21.1094L9.92766 18.4425C9.63344 18.2463 9.4292 17.9413 9.35987 17.5945C9.29054 17.2478 9.3618 16.8877 9.55798 16.5934C9.75415 16.2992 10.0592 16.095 10.4059 16.0256C10.7527 15.9563 11.1128 16.0276 11.407 16.2237L14.4102 18.2237L20.3095 11.1444C20.5359 10.8727 20.8609 10.7021 21.213 10.67C21.5652 10.6379 21.9157 10.7471 22.1873 10.9734C22.459 11.1998 22.6297 11.5248 22.6617 11.8769C22.6938 12.2291 22.5846 12.5796 22.3583 12.8513L15.6914 20.8512C15.5665 21.002 15.4099 21.1233 15.2327 21.2066C15.0555 21.2899 14.8622 21.3331 14.6664 21.3331Z" fill="#5A46D5"/>
          </svg>
        </div>
        <div class="carerr_text">
          Технокорп занимается разработкой и внедрением информационных технологий в нашей стране
        </div>
        <div>

        </div>
      </div>
    </section>
    <section class="container_s">
        <div class="resume">
            <div class="career_text1">Готовы присоединиться к нашей команде?</div>
          <div class="career_button">
            <NuxtLink to="/">
              Отправить резюме
            </NuxtLink>
          </div>
        </div>
    </section>
    <section class="container">
      <div class="row">
        <div class="col-xl-4" v-for="item in 6">
          <div class="car_card">
            <div class="car_icon">
              <div>
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M17 21V19C17 17.9391 16.5786 16.9217 15.8284 16.1716C15.0783 15.4214 14.0609 15 13 15H5C3.93913 15 2.92172 15.4214 2.17157 16.1716C1.42143 16.9217 1 17.9391 1 19V21M23 21V19C22.9993 18.1137 22.7044 17.2528 22.1614 16.5523C21.6184 15.8519 20.8581 15.3516 20 15.13M16 3.13C16.8604 3.3503 17.623 3.8507 18.1676 4.55231C18.7122 5.25392 19.0078 6.11683 19.0078 7.005C19.0078 7.89317 18.7122 8.75608 18.1676 9.45769C17.623 10.1593 16.8604 10.6597 16 10.88M13 7C13 9.20914 11.2091 11 9 11C6.79086 11 5 9.20914 5 7C5 4.79086 6.79086 3 9 3C11.2091 3 13 4.79086 13 7Z" stroke="#5A46D5" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>
              </div>
            </div>
            <div class="car_text">
              Большие и интересные проекты  с уникальной структурой
            </div>
            <div class="car_description">
              У нас есть интересные и разнообразные по сложности проекты!
            </div>
          </div>
        </div>
      </div>
      <div class="setResume">
        <div class="career_title">Отправьте резюме</div>
        <div class="form_category">
          <form>
            <div class="form_careers">
              <input type="text" placeholder="Ваше имя">
            </div>
            <div class="form_careers">
              <input type="text" placeholder="Email">
            </div>
            <div class="form_careers">
              <input type="text" placeholder="Телефон">
            </div>
            <div class="form_careers">
              <input type="text" placeholder="Сообщение">
            </div>
            <label for="fileR" class="form_files">
              <div class="f_career">
                <div>

                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_227_8696)">
                      <path d="M27.4275 12.5734C26.6854 10.4047 25.2645 8.53269 23.3753 7.23475C21.486 5.93681 19.2289 5.28197 16.9384 5.36725C14.6478 5.45253 12.4456 6.27339 10.6581 7.70821C8.87063 9.14304 7.59286 11.1155 7.01413 13.3334C5.24602 13.2874 3.53207 13.9457 2.24932 15.1634C0.966568 16.3812 0.220101 18.0586 0.174131 19.8267C0.12816 21.5948 0.786451 23.3088 2.00419 24.5915C3.22192 25.8743 4.89935 26.6207 6.66746 26.6667H13.3341V24.0001H6.66746C5.6066 24.0001 4.58918 23.5786 3.83904 22.8285C3.08889 22.0783 2.66746 21.0609 2.66746 20.0001C2.66746 18.9392 3.08889 17.9218 3.83904 17.1716C4.58918 16.4215 5.6066 16.0001 6.66746 16.0001C7.02401 16.0077 7.37806 16.0615 7.7208 16.1601L9.21413 16.5734L9.4008 15.0401C9.6351 13.2046 10.4984 11.5071 11.8437 10.2367C13.189 8.96623 14.9331 8.20143 16.779 8.0725C18.6248 7.94357 20.4583 8.45849 21.9672 9.52957C23.476 10.6006 24.5669 12.1616 25.0541 13.9467L25.2541 14.6667L25.9741 14.8801C26.9436 15.1537 27.7968 15.7372 28.4035 16.5413C29.0102 17.3454 29.3371 18.3261 29.3341 19.3334C29.3341 20.5711 28.8425 21.758 27.9673 22.6332C27.0921 23.5084 25.9051 24.0001 24.6675 24.0001H21.3341V26.6667H24.6675C26.3707 26.6792 28.0248 26.0961 29.3438 25.0184C30.6629 23.9407 31.5639 22.4361 31.8913 20.7645C32.2186 19.0929 31.9517 17.3595 31.1367 15.8639C30.3216 14.3682 29.0096 13.2044 27.4275 12.5734Z" fill="black"/>
                      <path d="M22.2801 20.3867L17.3334 15.4534L12.3867 20.3867L14.2801 22.28L16.0001 20.5467V26.6667H18.6667V20.5467L20.3867 22.28L22.2801 20.3867Z" fill="black"/>
                    </g>
                    <defs>
                      <clipPath id="clip0_227_8696">
                        <rect width="32" height="32" fill="white"/>
                      </clipPath>
                    </defs>
                  </svg>
                </div>
                <div>
                  <span>Резюме</span>
                </div>
              </div>
            </label>
            <input type="file" class="d-none" id="fileR">
            <div class="f_career_btn">
              <button>Отправить резюме</button>
            </div>
          </form>
        </div>
      </div>
    </section>
    </div>
                  </div>
     </div>
     
    <Footer></Footer>
      </div>

  </div>

</template>

<script>
export default {
  name: 'IndexPage'
}
</script>

