<template>
  <div>
    
      <div class="test_rejm"><marquee>{{$t('test')}}</marquee></div>
    <div class="managements ">
          <div class="cards_one_f">
                  <div>
                    <div class="cards_one">
       <Navbar></Navbar>
      <div class="nav_left_container">
        <div class="row">
          <div class="col-xl-6">
            <div class="main_text ">
              Руководство
            </div>
          </div>
          </div>
      </div>
    </div>
    <div class="manage_f">
          <section>
      <div class="managements_cards" v-for="item in 10">
        <div class="card_m" >
          <div class="border_center"></div>
          <div class="border_left"></div>
          <div class="c_card_img">
            <img src="../../assets/image/mm.png" alt="">
          </div>
          <div class="main_textt">
            <div class="m_card_leader">Директор</div>
            <div class="m_card_leader_name">Шоймардонов Навруз Мусурмонович</div>
            <div class="main_mail">
              <div class="mail">
                <div>
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4.5 3.75V11.25H1.5V21H14.25V18H22.5V8.25H17.25V3.75H4.5ZM6 5.25H15.75V8.25H9V11.25H6V5.25ZM10.5 9.75H21V16.5H14.25V11.25H10.5V9.75ZM17.25 11.25V12.75H19.5V11.25H17.25ZM3 12.75H4.5H9.75H12.75V13.585L8.2207 16.4004C8.01145 16.5309 7.7393 16.5316 7.5293 16.4004L3 13.5864V12.75ZM12.75 15.3516V19.5H3V15.353L6.73682 17.6748C7.08782 17.8931 7.482 18.0029 7.875 18.0029C8.268 18.0029 8.66147 17.8931 9.01172 17.6733L12.75 15.3516Z" fill="#5A46D5"/>
                  </svg>
                </div>
                <div class="email_name">
                  E-mail<br>
                  Shoymardonov@gmail.com
                </div>
              </div>
              <div class="mail">
                <div>

                  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4.49187 0.25C4.0993 0.25 3.71258 0.390625 3.39031 0.648438L3.34344 0.671875L3.32 0.695313L0.976249 3.10938L0.999687 3.13281C0.276054 3.80078 0.0533975 4.7998 0.366874 5.66406C0.369804 5.66992 0.363945 5.68164 0.366874 5.6875C1.00262 7.50684 2.62859 11.0195 5.80437 14.1953C8.99187 17.3828 12.5514 18.9443 14.3122 19.6328H14.3356C15.2468 19.9375 16.2341 19.7207 16.9372 19.1172L19.3044 16.75C19.9255 16.1289 19.9255 15.0508 19.3044 14.4297L16.2575 11.3828L16.2341 11.3359C15.613 10.7148 14.5114 10.7148 13.8903 11.3359L12.3903 12.8359C11.8483 12.5752 10.5563 11.9072 9.32 10.7266C8.09246 9.55469 7.46551 8.20703 7.23406 7.67969L8.73406 6.17969C9.36394 5.54981 9.37566 4.50098 8.71062 3.88281L8.73406 3.85938L8.66375 3.78906L5.66375 0.695313L5.64031 0.671875L5.59344 0.648438C5.27117 0.390625 4.88445 0.25 4.49187 0.25ZM4.49187 1.75C4.54754 1.75 4.6032 1.77637 4.65594 1.82031L7.65594 4.89063L7.72625 4.96094C7.72039 4.95508 7.77019 5.03418 7.67937 5.125L5.80437 7L5.45281 7.32813L5.61687 7.79688C5.61687 7.79688 6.4782 10.1025 8.28875 11.8281L8.45281 11.9688C10.196 13.5596 12.2497 14.4297 12.2497 14.4297L12.7184 14.6406L14.945 12.4141C15.0739 12.2852 15.0505 12.2852 15.1794 12.4141L18.2497 15.4844C18.3786 15.6133 18.3786 15.5664 18.2497 15.6953L15.9528 17.9922C15.6071 18.2881 15.2409 18.3496 14.8044 18.2031C13.1052 17.5352 9.8034 16.085 6.85906 13.1406C3.89129 10.1729 2.34148 6.80664 1.77312 5.17188C1.65887 4.86719 1.7409 4.41602 2.0075 4.1875L2.05437 4.14063L4.32781 1.82031C4.38055 1.77637 4.43621 1.75 4.49187 1.75Z" fill="#5A46D5"/>
                  </svg>

                </div>
                <div class="email_name">
                  Телефон<br>
                  +99 899 123 45 67
                </div>
              </div>
            </div>
          </div>
          <div class="m_buttons">
            <button>Задачи</button>
          </div>
        </div>
      
      </div>
    </section>
    </div>
                  </div>
     </div>
     
    <Footer></Footer>
      </div>

  </div>
</template>

<script>
export default {
  name: 'IndexPage'
}
</script>

